Revit 2027 API
RebarShapeDefinitionBySegments.SetSegmentAs180DegreeBend Method
Overload List
Name | Description
SetSegmentAs180DegreeBend(Int32) |  Indicates that a segment is a "virtual" segment introduced to describe a 180-degree bend. The radius of the bend will be taken from the Bar Type.
SetSegmentAs180DegreeBend(Int32, ElementId, Boolean) |  Indicate that a segment is a "virtual" segment introduced to describe a 180-degree bend. The radius of the bend will be driven by radiusParam.
Top
See Also
Reference
RebarShapeDefinitionBySegments Class
Autodesk.Revit.DB.Structure Namespace